Управление ИТ фирмой/DataProcessors/ЗаполнениеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеКалендаря</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Управление ИТ фирмой/InformationRegisters/Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Календарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рабочий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Управление ИТ фирмой/DataProcessors/ЗаполнениеКалендаря/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьКалендарьНаСервере()
	
	НаборЗаписей = РегистрыСведений.Календарь.СоздатьНаборЗаписей();
	
	ДатаНачала = '20260101';
	ДатаОкончания = '20261231';
	
	ТекущаяДата = ДатаНачала;
	Пока ТекущаяДата <= ДатаОкончания Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.День = ТекущаяДата;
		ДеньНедели = ДеньНедели(ТекущаяДата);
		
		Если ДеньНедели = 6 Или ДеньНедели = 7 Тогда
			НоваяЗапись.Рабочий = 0;
		Иначе
			НоваяЗапись.Рабочий = 1;
		КонецЕсли;
		
		ТекущаяДата = ТекущаяДата + 86400;
	КонецЦикла;
		
	НаборЗаписей.Записать(Истина);
	
	Сообщить("Календарь за 2026 год успешно заполнен!");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКалендарь(Команда)
	ЗаполнитьКалендарьНаСервере();
КонецПроцедуры
